{
    "game_variant": "MTG Treachery",
    "api_author": "Stefouch, Tymbaroth",
    "api_version": 0.2,
    "set_name": "Treachery",
    "set_code": "TRD-2025",
    "set_lang": "EN",
    "cards_count": 62,
    "cards": [
        {
            "id": 1,
            "name": "The Ætherist",
            "name_anchor": "the-Ætherist",
            "uri": "https://mtgtreachery.net/rules/oracle/?card=the-Ætherist",
            "cost": "",
            "cmc": 0,
            "color": "blue",
            "type": "Identity — Guardian",
            "types": {
                "supertype": "Identity",
                "subtype": "Guardian"
            },
            "rarity": "R",
            "text": "Undercover|Unveil {3}|When The Ætherist is unveiled, counter target spell. At the beginning of target player’s next main phase, they gain life and add an amount of {C} equal to that spell’s mana value.",
            "flavor": "",
            "artist": "Roggles (Rogie Custodio) @ DeviantArt",
            "rulings": [
                "The Ætherist’s unveiling triggered ability can target a spell that can’t be countered. When the ability resolves, that spell won’t be countered, but the targeted player will still gain life and add mana to their mana pool at the beginning of their next main phase.",
                "If the target spell is an illegal target when The Ætherist’s unveiling triggered ability tries to resolve, the targeted player still gets life and mana."
            ]
        },
        {
            "id": 2,
            "name": "The Augur",
            "name_anchor": "the-augur",
            "uri": "https://mtgtreachery.net/rules/oracle/?card=the-augur",
            "cost": "",
            "cmc": 0,
            "color": "blue",
            "type": "Identity — Guardian",
            "types": {
                "supertype": "Identity",
                "subtype": "Guardian"
            },
            "rarity": "R",
            "text": "Undercover|Unveil {X}|When The Augur is unveiled, target player shuffles, scries X, then exiles the top card of their library. They gain life equal to twice that card’s mana value, then they may cast it without paying its mana cost.",
            "flavor": "",
            "artist": "lorlandchain (Chen Wei) @ DeviantArt",
            "rulings": [
                "The X in the unveiling triggered ability has the same value as the X paid in the Unveil ability. This is pretty easy to derive since there is no other source of X.",
                "If X is 0, you won’t scry at all. Any abilities that trigger whenever you scry won’t trigger.",
                "Once The Augur’s unveiling triggered ability begins to resolve, no player may take other actions until it’s done. Notably, opponents can’t try to change your library after you scry but before you reveal the top card of your library.",
                "If the revealed card in your library has {X} in its mana cost, you must choose 0 as the value of X when casting it without paying its mana cost.",
                "If you exile a land card this way, you can’t play it. Its mana value is 0 and you won’t gain life.",
                "The revealed card played with The Augur’s unveiling triggered ability is played from your library.",
                "If you play the revealed card, you do so as part of the resolution of the triggered ability. You can’t wait to play it later in the turn. Timing permissions based on the card’s type are ignored, but other restrictions (such as \"Cast [this card] only during combat\") are not.",
                "If you cast a card \"without paying its mana cost,\" you can’t pay any alternative costs. You can, however, pay additional costs. If the card has any mandatory additional costs, such as that of Costly Plunder, those must be paid to cast the card.",
                "The converted mana cost of a split card is based on the combined mana cost of its two halves."
            ]
        },
        {
            "id": 3,
            "name": "The Bodyguard",
            "name_anchor": "the-bodyguard",
            "uri": "https://mtgtreachery.net/rules/oracle/?card=the-bodyguard",
            "cost": "",
            "cmc": 0,
            "color": "blue",
            "type": "Identity — Guardian",
            "types": {
                "supertype": "Identity",
                "subtype": "Guardian"
            },
            "rarity": "U",
            "text": "Undercover (Unveil only if another identity has been revealed or if another player attacked the Leader this game.)|Unveil {4} (Start the game with this identity face down in the command zone. Turn it face up any time for its unveil cost.)|When The Bodyguard is unveiled, until your next turn, prevent all damage that would be dealt to target player and each creature and planeswalker they control.",
            "flavor": "",
            "artist": "Hokunin (Prokopii Osipov) @ DeviantArt",
            "rulings": [
                "The replacement effect stops as your next untap step begins, before you untap your permanents. If this causes any state-based actions to become applicable, or if any abilities trigger, those are handled during your upkeep."
            ]
        },
        {
            "id": 4,
            "name": "The Cathar",
            "name_anchor": "the-cathar",
            "uri": "https://mtgtreachery.net/rules/oracle/?card=the-cathar",
            "cost": "",
            "cmc": 0,
            "color": "blue",
            "type": "Identity — Guardian",
            "types": {
                "supertype": "Identity",
                "subtype": "Guardian"
            },
            "rarity": "U",
            "text": "Undercover (Unveil only if another identity has been revealed or if another player attacked the Leader this game.)|Unveil—{5}, Pay 5 life. (Start the game with this identity face down in the command zone. Turn it face up any time for its unveil cost.)|When The Cathar is unveiled, exile up to three target nonland permanents until you lose the game. (Those permanents return under their owners’ control.)",
            "flavor": "",
            "artist": "akizhao @ DeviantArt",
            "rulings": [
                "You can’t pay the unveil cost if your life total is less than 5.",
                "If The Cathar’s controller loses the game before the triggered ability resolves, the targeted permanents won’t be exiled.",
                "Auras attached to the exiled permanents will be put into their owners’ graveyards. Any Equipment will become unattached and remain on the battlefield. Any counters on the exiled permanent will cease to exist. When the card returns to the battlefield, it will be a new object with no connection to the card that was exiled.",
                "If a token is exiled this way, it will cease to exist and won’t return to the battlefield."
            ]
        },
        {
            "id": 5,
            "name": "The Cryomancer",
            "name_anchor": "the-cryomancer",
            "uri": "https://mtgtreachery.net/rules/oracle/?card=the-cryomancer",
            "cost": "",
            "cmc": 0,
            "color": "blue",
            "type": "Identity — Guardian",
            "types": {
                "supertype": "Identity",
                "subtype": "Guardian"
            },
            "rarity": "R",
            "text": "Undercover|Unveil {X}|When The Cryomancer is unveiled, tap X target permanents and remove them from combat. If it’s your turn, distribute X stun counters among any number of those permanents. (If a permanent with a stun counter would become untapped, remove one from it instead.)",
            "flavor": "",
            "artist": "OPOA @ Pinterest",
            "rulings": [
                "The X in the unveiling triggered ability has the same value as the X paid in the Unveil ability. This is pretty easy to derive since there is no other source of X.",
                "The Cryomancer’s unveiling triggered ability may target permanents that are already tapped. It can still put stun counters on them."
            ]
        },
        {
            "id": 6,
            "name": "The Flickering Mage",
            "name_anchor": "the-flickering-mage",
            "uri": "https://mtgtreachery.net/rules/oracle/?card=the-flickering-mage",
            "cost": "",
            "cmc": 0,
            "color": "blue",
            "type": "Identity — Guardian",
            "types": {
                "supertype": "Identity",
                "subtype": "Guardian"
            },
            "rarity": "U",
            "text": "Undercover (Unveil only if another identity has been revealed or if another player attacked the Leader this game.)|Unveil {4} (Start the game with this identity face down in the command zone. Turn it face up any time for its unveil cost.)|When The Flickering Mage is unveiled, exile up to four target nonland permanents. Return those cards to the battlefield tapped under their owner’s control at the beginning of the next end step.",
            "flavor": "",
            "artist": "Zolaida (Lisa Buijteweg) @ DeviantArt",
            "rulings": [
                "All cards exiled with The Flickering Mage will return to the battlefield, even if they’re no longer creatures.",
                "If a creature token is exiled, it ceases to exist. It won’t be returned to the battlefield.",
                "If a double-faced card is exiled, it will return with its front face up.",
                "When the creatures are exiled, any Auras or Equipment on them fall off and any counters on them are removed. When they return to the battlefield, they come back tapped and are treated as new versions of the cards.",
                "Normally, the creatures will return to the battlefield at the end of the same turn they were exiled. But if they’re exiled during the End step, it’s too late to return them this turn. They have to wait to return to the battlefield until the next End step."
            ]
        },
        {
            "id": 7,
            "name": "The Golem",
            "name_anchor": "the-golem",
            "uri": "https://mtgtreachery.net/rules/oracle/?card=the-golem",
            "cost": "",
            "cmc": 0,
            "color": "blue",
            "type": "Identity — Guardian",
            "types": {
                "supertype": "Identity",
                "subtype": "Guardian"
            },
            "rarity": "U",
            "text": "Undercover (Unveil only if another identity has been revealed or if another player attacked the Leader this game.)|Unveil {6} (Start the game with this identity face down in the command zone. Turn it face up any time for its unveil cost.)|When The Golem is unveiled, target Leader player loses 6 life and you gain 6 life.|Leader players have hexproof and can’t be attacked. (Until you lose the game.)",
            "flavor": "",
            "artist": "Michael Phillippi @ DeviantArt",
            "rulings": [
                "When The Golem’s unveiling ability triggers, you may target a Leader player that has hexproof because you are now considered teammates as both your identity cards are face up.",
                "The Golem’s last ability affects the game only while the identity card is face up, and until its controller loses the game."
            ]
        },
        {
            "id": 8,
            "name": "The Great Martyr",
            "name_anchor": "the-great-martyr",
            "uri": "https://mtgtreachery.net/rules/oracle/?card=the-great-martyr",
            "cost": "",
            "cmc": 0,
            "color": "blue",
            "type": "Identity — Guardian",
            "types": {
                "supertype": "Identity",
                "subtype": "Guardian"
            },
            "rarity": "M",
            "text": "Undercover|Unveil {2}|When The Great Martyr is unveiled, until end of turn, if a source an opponent controls would deal damage to a Leader player, that damage is dealt to you instead. The same is true for losing life, discarding cards and sacrificing permanents. Whenever you are dealt damage or lose life this way, draw half that many cards, rounded up. Whenever you discard a card or sacrifice a permanent this way, you gain 2life.",
            "flavor": "",
            "artist": "Jason Engle @ DeviantArt",
            "rulings": [
                "The Great Martyr’s replacement effect redirects all damage to you and any results following that damage, like commander damage and poison counters from infect source.",
                "If you don’t have enough cards to discard or permanents to sacrifice, you discard or sacrifice as much as you can, even if it’s nothing.",
                "This ability affects sacrifices, but not any other ways permanents can leave the battlefield. It won’t stop a creature controlled by a Leader from being put into the graveyard due to lethal damage or having 0 toughness, and it won’t stop a permanent from being put into the graveyard due to the \"legend rule.\" None of these are sacrifices; they’re the result of game rules.",
                "If an effect your opponent controls reduces the maximum hand size of a Leader player, The Great Martyr’s replacement effect won’t apply and that Leader player still discards cards when the game rules cause them to discard during their cleanup step.",
                "An effect that prevents you from losing life will apply and any damage redirected to you by The Great Martyr’s replacement effect will do nothing.",
                "An effect that prevents you from discarding cards or sacrificing permanents (as Tamiyo, Collector of Tales does) will apply and any discard or sacrifice effect redirected to you will do nothing.",
                "An effect that prevents a Leader player from losing life, discarding cards or sacrificing permanents may be applied before or after The Great Martyr’s replacement effect, as they choose.",
                "If an effect from a source an opponent controls states that something happens unless a Leader player pays life, discards a card or sacrifices a permanent (as Mogis, God of Slaughter does), or if an effect from a source an opponent controls instructs a Leader player to pay life, discard a card or sacrifice a permanent unless they perform an action (as Killing Wave does), and they choose to perform the action, instead you lose that much life, discard that many cards or sacrifice that many permanents.",
                "If a Leader player spends life, discards a card or sacrifices a permanent to pay a cost of an ability an opponent controls (such as Excavation), The Great Martyr’s replacement effect does not apply and that Leader player still pays the cost themselves.",
                "When The Great Martyr’s controller is dealt 1 or 2 damage this way, they only draw one card."
            ]
        },
        {
            "id": 9,
            "name": "The Immortal",
            "name_anchor": "the-immortal",
            "uri": "https://mtgtreachery.net/rules/oracle/?card=the-immortal",
            "cost": "",
            "cmc": 0,
            "color": "blue",
            "type": "Identity — Guardian",
            "types": {
                "supertype": "Identity",
                "subtype": "Guardian"
            },
            "rarity": "U",
            "text": "Undercover (Unveil only if another identity has been revealed or if another player attacked the Leader this game.)|Unveil {3} (Start the game with this identity face down in the command zone. Turn it face up any time for its unveil cost.)|When The Immortal is unveiled, up to one target player gains 15 life and up to one target player shuffles their graveyard into their library.",
            "flavor": "",
            "artist": "malisaa @ DeviantArt",
            "rulings": [
                "If you choose both modes, you may target a single player twice."
            ]
        },
        {
            "id": 10,
            "name": "The Inquisitor",
            "name_anchor": "the-inquisitor",
            "uri": "https://mtgtreachery.net/rules/oracle/?card=the-inquisitor",
            "cost": "",
            "cmc": 0,
            "color": "blue",
            "type": "Identity — Guardian",
            "types": {
                "supertype": "Identity",
                "subtype": "Guardian"
            },
            "rarity": "U",
            "text": "Undercover (Unveil only if another identity has been revealed or if another player attacked the Leader this game.)|Unveil {X}{1} (Start the game with this identity face down in the command zone. Turn it face up any time for its unveil cost.)|When The Inquisitor is unveiled, choose X other target players. They each reveal their hand. For each of those players, choose a card from their graveyard or hand and exile it.",
            "flavor": "",
            "artist": "Asahisuperdry @ DeviantArt",
            "rulings": [
                "No extra rules information."
            ]
        },
        {
            "id": 11,
            "name": "The Marshal",
            "name_anchor": "the-marshal",
            "uri": "https://mtgtreachery.net/rules/oracle/?card=the-marshal",
            "cost": "",
            "cmc": 0,
            "color": "blue",
            "type": "Identity — Guardian",
            "types": {
                "supertype": "Identity",
                "subtype": "Guardian"
            },
            "rarity": "R",
            "text": "Undercover|Unveil {X}{4}|When The Marshal is unveiled, choose a color and a creature type. Target player creates X plus four 1/1 creature tokens of the chosen color and type. If X is 3 or more, destroy all other creatures.",
            "flavor": "",
            "artist": "Diego Gisbert Llorens @ DeviantArt",
            "rulings": [
                "The X in the unveiling triggered ability has the same value as the X paid in the Unveil ability. This is pretty easy to derive since there is no other source of X.",
                "The Marshal’s unveiling triggered ability checks the number you chose for X, not the amount of mana you actually spent.",
                "You do what the spell says in order. If X is 4 or more, you’ll put the creature tokens onto the battlefield, then you’ll destroy other creatures.",
                "No one can cast spells or activate abilities between the time the creature tokens are put onto the battlefield and the time all other creatures are destroyed. For example, you can’t sacrifice one of those tokens to regenerate a Dimir House Guard.",
                "You must choose an existing creature type, such as Fish or Artificer. You can’t choose card types (e.g., artifact) or supertypes (e.g., snow)."
            ]
        },
        {
            "id": 12,
            "name": "The Mirror Maestra",
            "name_anchor": "the-mirror-maestra",
            "uri": "https://mtgtreachery.net/rules/oracle/?card=the-mirror-maestra",
            "cost": "",
            "cmc": 0,
            "color": "blue",
            "type": "Identity — Guardian",
            "types": {
                "supertype": "Identity",
                "subtype": "Guardian"
            },
            "rarity": "U",
            "text": "Undercover (Unveil only if another identity has been revealed or if another player attacked the Leader this game.)|Unveil {X}{X}{2} (Start the game with this identity face down in the command zone. Turn it face up any time for its unveil cost.)|When The Mirror Maestra is unveiled, choose a player and X target permanents. For each of those permanents, that player creates a token that’s a copy of it.",
            "flavor": "",
            "artist": "Anne Stokes",
            "rulings": [
                "The X in the unveiling triggered ability has the same value as the X paid in the Unveil ability. This is pretty easy to derive since there is no other source of X.",
                "The token copies exactly what was printed on the original card and nothing else, with the listed exceptions (unless that permanent is itself copying something else; see below). It doesn’t copy whether that permanent is tapped or untapped, whether it has any counters on it or Auras attached to it, or any non-copy effects that have changed its power, toughness, types, color, and so on.",
                "If the copied permanent is copying something else, then the token enters the battlefield as whatever that permanent copied, with the listed exceptions.",
                "If the copied permanent has {X} in its mana cost, X is 0.",
                "If the copied permanent is itself a token, the token created by The Mirror Maestra’s unveiling triggered ability copies the original characteristics of that token as stated by the effect that created it, with the listed exception.",
                "Any enters-the-battlefield abilities of the copied permanent will trigger when the token enters the battlefield. Any \"as [this permanent] enters the battlefield\" or \"[this permanent] enters the battlefield with\" abilities of the permanent will also work."
            ]
        },
        {
            "id": 13,
            "name": "The Oracle",
            "name_anchor": "the-oracle",
            "uri": "https://mtgtreachery.net/rules/oracle/?card=the-oracle",
            "cost": "",
            "cmc": 0,
            "color": "blue",
            "type": "Identity — Guardian",
            "types": {
                "supertype": "Identity",
                "subtype": "Guardian"
            },
            "rarity": "M",
            "text": "Undercover|Unveil {2}|When The Oracle is unveiled, until end of turn, Leader players have protection from everything and their life totals can’t change. (They can’t be targeted, dealt damage, or enchanted by anything and their life totals can’t change.)",
            "flavor": "",
            "artist": "GENZOMAN (Gonzalo Ordóñez Arias) @ DeviantArt",
            "rulings": [
                "---------- The following rulings focus on the \"protection from\" keyword ----------",
                "If a player has protection from everything, it means three things: 1) All damage that would be dealt to that player is prevented. 2) Auras can’t be attached to that player. 3) That player can’t be the target of spells or abilities.",
                "Nothing other than the specified events are prevented or illegal. An effect that doesn’t target you could still cause you to discard cards, for example. Creatures can still attack you while you have protection from everything, although combat damage that they would deal to you will be prevented.",
                "Gaining protection from everything causes a spell or ability on the stack to have an illegal target if it targets you. As a spell or ability tries to resolve, if all its targets are illegal, that spell or ability is countered and none of its effects happen, including effects unrelated to the target. If at least one target is still legal, the spell or ability does as much as it can to the remaining legal targets, and its other effects still happen.",
                "---------- The following rulings focus on what it means if your life total can’t change ----------",
                "Spells and abilities that would normally cause you to gain or lose life still resolve while your life total can’t change, but the life-gain or life-loss part simply has no effect.",
                "Protection from everything will usually prevent damage if it would be dealt to you, but some damage can’t be prevented. In this case, because your life total also can’t change, that damage has any other effects that it may have aside from causing you to lose that much life (such as effects from lifelink or infect) and triggers and effects can see that damage was dealt even though your life total didn’t change.",
                "You can’t pay a cost that includes the payment of any amount of life other than 0 life.",
                "If a cost includes causing you to gain life (like the alternative cost of an opponent’s Invigorate does), that cost can’t be paid.",
                "Effects that would replace having you gain life with some other event won’t be able to be applied because it’s impossible for you to gain life. The same is true for effects that would replace having you lose life with some other event.",
                "Effects that replace an event with having you gain life (like Words of Worship’s effect does) or having you lose life will apply and end up replacing the event with nothing.",
                "If an effect would set your life total to a certain number that’s different than your current life total, that part of the effect won’t do anything.",
                "If an effect would cause you to exchange life totals with another player, the exchange won’t happen. Neither player’s life total changes."
            ]
        },
        {
            "id": 14,
            "name": "The Quellmaster",
            "name_anchor": "the-quellmaster",
            "uri": "https://mtgtreachery.net/rules/oracle/?card=the-quellmaster",
            "cost": "",
            "cmc": 0,
            "color": "blue",
            "type": "Identity — Guardian",
            "types": {
                "supertype": "Identity",
                "subtype": "Guardian"
            },
            "rarity": "R",
            "text": "Undercover|Unveil {9}. This cost is reduced by {1} for each creature controlled by non-Leader players.|When The Quellmaster is unveiled, tap all creatures controlled by non-Leader players and put a stun counter on each of them. (If a permanent with a stun counter would become untapped, remove one from it instead.)",
            "flavor": "",
            "artist": "Kekai @ CGHUB",
            "rulings": [
                "The second part of The Quellmaster’s effect puts a stun counter on all creatures controlled by non-Leader players as it resolves, not just the ones that The Quellmaster actually caused to become tapped."
            ]
        },
        {
            "id": 15,
            "name": "The Spellsnatcher",
            "name_anchor": "the-spellsnatcher",
            "uri": "https://mtgtreachery.net/rules/oracle/?card=the-spellsnatcher",
            "cost": "",
            "cmc": 0,
            "color": "blue",
            "type": "Identity — Guardian",
            "types": {
                "supertype": "Identity",
                "subtype": "Guardian"
            },
            "rarity": "R",
            "text": "Undercover|Unveil {4}|When The Spellsnatcher is unveiled, counter target spell. If that spell is countered this way, exile it instead of putting it into its owner’s graveyard. You may cast that card without paying its mana cost for as long as it remains exiled.",
            "flavor": "",
            "artist": "bpsola (Bryan Marvin P. Sola) @ DeviantArt",
            "rulings": [
                "You can target a spell you control with The Spellsnatcher’s unveiling triggered ability. This will give you the ability to cast the card later without paying its mana cost.",
                "If you cast a spell \"without paying its mana cost,\" you can’t choose to cast it for any alternative costs. You can, however, pay additional costs, such as kicker costs. If the spell has any mandatory additional costs those must be paid to cast the spell.",
                "If a spell has {X} in its mana cost, you must choose 0 as the value of X when casting it without paying its mana cost."
            ]
        },
        {
            "id": 16,
            "name": "The Summoner",
            "name_anchor": "the-summoner",
            "uri": "https://mtgtreachery.net/rules/oracle/?card=the-summoner",
            "cost": "",
            "cmc": 0,
            "color": "blue",
            "type": "Identity — Guardian",
            "types": {
                "supertype": "Identity",
                "subtype": "Guardian"
            },
            "rarity": "R",
            "text": "Undercover|Unveil {X}{Y}. X and Y can’t be 0.|When The Summoner is unveiled, target player creates X 0/0 colorless Shapeshifter creature tokens with changeling and reach. Put Y +1/+1 counters on each of them.",
            "flavor": "",
            "artist": "Kevin Glint @ ArtStation",
            "rulings": [
                "The X and Y in the unveiling triggered ability have the same value as the X and Y paid in the Unveil ability. This is pretty easy to derive since there is no other sources of X and Y."
            ]
        },
        {
            "id": 17,
            "name": "The Supplier",
            "name_anchor": "the-supplier",
            "uri": "https://mtgtreachery.net/rules/oracle/?card=the-supplier",
            "cost": "",
            "cmc": 0,
            "color": "blue",
            "type": "Identity — Guardian",
            "types": {
                "supertype": "Identity",
                "subtype": "Guardian"
            },
            "rarity": "M",
            "text": "Undercover|Unveil—Discard a nonland card.|When The Supplier is unveiled, you get {m}{m}{m}{m}{m}{m} (six gem counters).|{1}, Pay {m}: Target player chooses a card from their graveyard or an exiled card they own and puts it into their library third from the top.|{2}, Pay {m}{m}: Target player reveals the top seven cards of their library. They put two of them into their hand and the rest on the bottom of their library in a random order.",
            "flavor": "",
            "artist": "Kieran Yanner",
            "rulings": [
                "You can’t pay the unveil cost if you have no cards in hand.",
                "The Supplier’s fourth and fifth abilities can be activated only while the identity card is face up.",
                "If The Supplier affects a suspended card, the card loses its time counters and is no longer suspended. (This doesn’t trigger the last ability of suspend.)",
                "If The Supplier affects a card that’s haunting a creature, the haunt effect ends.",
                "{m} is the gem symbol. It represents one gem counter.",
                "Gem counters are a kind of counter that a player may have. They’re not associated with specific permanents. (Other kinds of counters that players may have include poison, energy and experience.)",
                "Keep careful track of how many gem counters the player has. You may do so by keeping a running count on paper, by using a die on that card, or by any other clear and mutually agreeable method.",
                "If an effect says you get one or more {m}, you get that many gem counters. To pay one or more {m}, you lose that many gem counters. Any effects that interact with counters a player gets, has, or loses can interact with gem counters."
            ]
        },
        {
            "id": 18,
            "name": "The Warlock",
            "name_anchor": "the-warlock",
            "uri": "https://mtgtreachery.net/rules/oracle/?card=the-warlock",
            "cost": "",
            "cmc": 0,
            "color": "blue",
            "type": "Identity — Guardian",
            "types": {
                "supertype": "Identity",
                "subtype": "Guardian"
            },
            "rarity": "M",
            "text": "Undercover|Unveil {3}|When The Warlock is unveiled, end the phase if it isn’t the ending phase. (Exile all spells and abilities on the stack. Remove all creatures from combat. Then, the active player begins their next phase.)",
            "flavor": "",
            "artist": "Hokunin (Prokopii Osipov) @ DeviantArt",
            "rulings": [
                "Ending the phase this way means the following things happen in order: 1) All spells and abilities on the stack are exiled. This includes spells and abilities that can’t be countered. 2) If there are any attacking and blocking creatures, they’re removed from combat. 3) State-based actions are checked. No player gets priority, and no triggered abilities are put onto the stack. 4) The current phase and/or step ends. The game skips straight to the next phase.",
                "If any triggered abilities do trigger during this process, they’re put onto the stack at the beginning of the next step or phase.",
                "Though other spells and abilities that are exiled won’t get a chance to resolve, they don’t count as being countered.",
                "The phases of a turn are, in order, beginning, precombat main, combat, postcombat main, and ending."
            ]
        },
        {
            "id": 19,
            "name": "The Banisher",
            "name_anchor": "the-banisher",
            "uri": "https://mtgtreachery.net/rules/oracle/?card=the-banisher",
            "cost": "",
            "cmc": 0,
            "color": "black",
            "type": "Identity — Traitor",
            "types": {
                "supertype": "Identity",
                "subtype": "Traitor"
            },
            "rarity": "U",
            "text": "Unveil {7} (Start the game with this identity face down in the command zone. Turn it face up any time for its unveil cost.)|When The Banisher is unveiled, exile any number of target creatures. Draw a card for each nontoken creature exiled this way.",
            "flavor": "",
            "artist": "Astri Lohne @ ArtStation",
            "rulings": [
                "No extra rules information."
            ]
        },
        {
            "id": 20,
            "name": "The Cleaner",
            "name_anchor": "the-cleaner",
            "uri": "https://mtgtreachery.net/rules/oracle/?card=the-cleaner",
            "cost": "",
            "cmc": 0,
            "color": "black",
            "type": "Identity — Traitor",
            "types": {
                "supertype": "Identity",
                "subtype": "Traitor"
            },
            "rarity": "R",
            "text": "Unveil {8} (Start the game with this identity face down in the command zone. Turn it face up any time for its unveil cost.)|When The Cleaner is unveiled, if it’s your turn, exile all nonland permanents you don’t control and all opponents’ graveyards.",
            "flavor": "",
            "artist": "Snook-8 @ DeviantArt",
            "rulings": [
                "No extra rules information."
            ]
        },
        {
            "id": 21,
            "name": "The Ferryman",
            "name_anchor": "the-ferryman",
            "uri": "https://mtgtreachery.net/rules/oracle/?card=the-ferryman",
            "cost": "",
            "cmc": 0,
            "color": "black",
            "type": "Identity — Traitor",
            "types": {
                "supertype": "Identity",
                "subtype": "Traitor"
            },
            "rarity": "M",
            "text": "Unveil {1}|When The Ferryman is unveiled, choose target permanent. When that permanent is put into a graveyard this turn, return another card that shares a card type with it from that graveyard to the battlefield under your control.|{3}: Turn The Ferryman face down. Activate only during your turn and only once each turn.",
            "flavor": "",
            "artist": "Andrew Hou",
            "rulings": [
                "All The Ferryman does when it resolves is set up a delayed triggered ability. If the targeted permanent isn’t put into a graveyard this turn, that ability never triggers. If the targeted permanent is put into a graveyard this turn, that ability triggers and resolves like any other triggered ability.",
                "The permanent card that will be returned to the battlefield isn’t chosen until the delayed triggered ability resolves. The player who chooses is the player who controlled The Ferryman.",
                "The permanent that’s returned to the battlefield can’t be the same one that was put into the graveyard (assuming it’s still in the graveyard when the delayed triggered ability resolves)."
            ]
        },
        {
            "id": 22,
            "name": "The Gatekeeper",
            "name_anchor": "the-gatekeeper",
            "uri": "https://mtgtreachery.net/rules/oracle/?card=the-gatekeeper",
            "cost": "",
            "cmc": 0,
            "color": "black",
            "type": "Identity — Traitor",
            "types": {
                "supertype": "Identity",
                "subtype": "Traitor"
            },
            "rarity": "U",
            "text": "Unveil {3} (Start the game with this identity face down in the command zone. Turn it face up any time for its unveil cost.)|When The Gatekeeper is unveiled, create Cerberus, a legendary 4/8 black and red Demon Dog creature token with menace, double strike, trample, and lifelink.|{2}: Turn The Gatekeeper face down.",
            "flavor": "",
            "artist": "Pierluigi Abbondanza @ DeviantArt",
            "rulings": [
                "The Gatekeeper’s last ability (turning face down) can be activated only while the identity card is face up.",
                "If you turn The Gatekeeper face down, your opponents will still remember your role."
            ]
        },
        {
            "id": 23,
            "name": "The Grenadier",
            "name_anchor": "the-grenadier",
            "uri": "https://mtgtreachery.net/rules/oracle/?card=the-grenadier",
            "cost": "",
            "cmc": 0,
            "color": "black",
            "type": "Identity — Traitor",
            "types": {
                "supertype": "Identity",
                "subtype": "Traitor"
            },
            "rarity": "U",
            "text": "Unveil {X} (Start the game with this identity face down in the command zone. Turn it face up any time for its unveil cost.)|When The Grenadier is unveiled, create X plus three colorless artifact tokens named Explosive.|{1}, Sacrifice a token named Explosive: Choose one —|• Destroy target nonland permanent.|• Target player loses 3 life.",
            "flavor": "",
            "artist": "Kekai @ CGHUB",
            "rulings": [
                "The X in the unveiling triggered ability has the same value as the X paid in the Unveil ability. This is pretty easy to derive since there is no other source of X.",
                "An Explosive is an artifact with no ability."
            ]
        },
        {
            "id": 24,
            "name": "He Who Comes To Save The Day",
            "name_anchor": "he-who-comes-to-save-the-day",
            "uri": "https://mtgtreachery.net/rules/oracle/?card=he-who-comes-to-save-the-day",
            "cost": "",
            "cmc": 0,
            "color": "black",
            "type": "Identity — Traitor",
            "types": {
                "supertype": "Identity",
                "subtype": "Traitor"
            },
            "rarity": "M",
            "text": "Unveil {2}|When He Who Comes To Save The Day is unveiled, the next time target player would lose the game this turn, instead they shuffle their hand, their graveyard, and all permanents they own into their library, then they draw twelve cards and their life total becomes 12. Then that player puts any number of permanent cards with mana value 4 or less from their hand onto the battlefield.",
            "flavor": "",
            "artist": "Kekai @ CGHUB",
            "rulings": [
                "On resolution, the unveiling triggered ability creates a replacement effect that can apply only one time, and only until the end of the turn. This replacement effect is mentioned hereinbelow the \"save effect.\"",
                "Anything that triggers during the resolution of the Save effect will wait to be put on the stack until everything is put onto the battlefield and resolution is complete. The player whose turn it is will put all of their triggered abilities on the stack in any order, then each other player in turn order will do the same. (The last ability put on the stack will be the first one that resolves.)",
                "If an effect says that the targeted player can’t lose the game, the save effect doesn’t apply.",
                "The save effect applies any time the targeted player would lose the game, even if they’re not losing due to your life total being 0 or less. If the targeted player would have lost the game because they tried to draw from an empty library, their life total becomes 12 and they won’t lose again until they try to draw again and still can’t do so. If the targeted player would have lost the game due to having ten or more poison counters, their life total becomes 12, but they will lose the game immediately afterward because they still have ten or more poison counters.",
                "The save effect does nothing on a player that concedes the game. A player who concedes leaves the game.",
                "The save effect shuffles permanents owned by the targeted player into their library, regardless of who controls them.",
                "The Save effect shuffles tokens owned by the targeted player into their library, too. The tokens they own will leave play. However, there’s no point to physically shuffle tokens into the library because the player can’t draw them as part of the Save effect and they’ll cease to exist immediately afterwards.",
                "The Save effect doesn’t affect spells on the stack, cards that have been exiled, or permanents the targeted player controls but doesn’t own. They’ll stay where they are. Spells on the stack will then resolve as normal.",
                "For a player’s life total to become 12, they will gain or lose the appropriate amount of life. For example, if the targeted player’s life total is -4 when this card’s unveiling ability applies, it will cause that player to gain 16 life. Alternatively, if the targeted player’s life total is 20 when it applies (perhaps because they tried to draw a card from an empty library), they will lose 8 life. Other cards that interact with life gain or life loss will interact with this effect accordingly. Notably, this means that if the targeted player can’t gain life or the life gain event is modified by another replacement effect, they might still have 0 or less life and still lose the game.",
                "If a spell causes the targeted player to lose the game the next time state-based actions are checked (by dealing damage to them greater than their life total, for example), that spell will already be in the graveyard by the time the Save effect happens. If it’s in their graveyard, it will be shuffled into their library.",
                "If, during a check of state-based actions, the targeted player would lose the game at the same time a creature they own would be put into their graveyard (due to an Earthquake for 10 or combat damage dealt to both the player and the creature, for example), that creature’s controller has a choice to make. The state-based actions rule is trying to simultaneously (a) shuffle that creature card into the player’s library (due to the Save replacement effect) and (b) put it into their graveyard. Only one of those things can happen. The creature’s controller chooses which one. If the creature is put into the graveyard, it isn’t shuffled into the library. Abilities that trigger when that creature is put into a graveyard will trigger only if that option is chosen.",
                "If, during a check of state-based actions, the targeted player would lose the game for multiple reasons (for example, if they were at 1 life and had one card in their library, then Night’s Whisper caused them to draw two cards and lose 2 life), a single Save effect will replace all of them. You’ll do what the Save effect says just once.",
                "A token’s owner is the player who created it.",
                "If an effect states that an opponent wins the game, the Save effect doesn’t apply.",
                "In a Two-Headed Giant game, if the targeted player’s team would lose the game during a Save effect, the team won’t lose. Instead, the targeted player will do what the Save effect says and their teammate won’t do anything. This is true even if the reason the team would lose is because the teammate tried to draw a card with an empty library or was affected by an ability that said they lost the game. The targeted player’s life total (which is the same as their team’s life total) becomes 12. The team’s life total is adjusted by the amount of life the targeted player gains or loses as a result of this, which basically means the team’s life total becomes 12.",
                "If a card in a player’s hand has {X} in its mana cost, X is considered to be 0.",
                "If a permanent card in a player’s hand has no mana symbols in its upper right corner (because it’s a land card, for example), its mana value is 0."
            ]
        },
        {
            "id": 25,
            "name": "The Metamorph",
            "name_anchor": "the-metamorph",
            "uri": "https://mtgtreachery.net/rules/oracle/?card=the-metamorph",
            "cost": "",
            "cmc": 0,
            "color": "black",
            "type": "Identity — Traitor",
            "types": {
                "supertype": "Identity",
                "subtype": "Traitor"
            },
            "rarity": "S",
            "text": "Unveil—Pay 8 life, Discard a card.|When The Metamorph is unveiled, until end of turn, as an opponent loses the game, you may remove The Metamorph from the game. If you do, gain control of that player’s identity card and turn it face down if it isn’t a Leader.",
            "flavor": "",
            "artist": "Myrmirada (Anna Verhoog) @ DeviantArt",
            "rulings": [
                "You can’t pay the unveil cost if you have no cards in hand or if your life total is less than 8.",
                "You may steal the Leader player’s identity card as they lose the game. If you do, the game will go on.",
                "\"Remove from the game\" means to put it outside the game, not exiling it.",
                "If the game is restarted and The Metamorph was removed from the game, it comes back to the new game. This is an exception to rule 108.5 in the official CR due to rule 716.2 in the official CR taking precedence. The previously stolen identity card in the restarted game will leave the game as its original owner has lost that game.",
                "The Metamorph’s replacement effect will apply no matter how a player loses the game: due to a state-based action (as a result of having a life total of 0 or less, trying to draw a card from an empty library, or having ten poison counters), a spell or ability that says that player loses the game, a concession, or a game loss awarded by a judge.",
                "In a multiplayer game using the limited range of influence option (such as a Grand Melee game), if a spell or ability says that you win the game, it instead causes all of your opponents within your range of influence to lose the game. This is another way by which The Metamorph’s replacement effect can apply.",
                "The victim who had their identity card stolen by The Metamorph remains a member of the last known team they were before.",
                "You’re changing team according to your new role."
            ]
        },
        {
            "id": 26,
            "name": "The Oneiromancer",
            "name_anchor": "the-oneiromancer",
            "uri": "https://mtgtreachery.net/rules/oracle/?card=the-oneiromancer",
            "cost": "",
            "cmc": 0,
            "color": "black",
            "type": "Identity — Traitor",
            "types": {
                "supertype": "Identity",
                "subtype": "Traitor"
            },
            "rarity": "U",
            "text": "Unveil {X}{X} (Start the game with this identity face down in the command zone. Turn it face up any time for its unveil cost.)|When The Oneiromancer is unveiled, exile the top X cards of each player’s library face down.|You may look at cards exiled with The Oneiromancer.|Once each turn, you may cast a spell among cards exiled with The Oneiromancer without paying its mana cost. When you do, exile the top card of target player’s library face down.",
            "flavor": "",
            "artist": "Hamsterfly (Viktor Titov) @ DeviantArt",
            "rulings": [
                "The X in the unveiling triggered ability has the same value as the X paid in the Unveil ability. This is pretty easy to derive since there is no other source of X.",
                "An effect that instructs you to \"cast\" a card doesn’t allow you to play lands.",
                "If another player gains control of The Oneiromancer, that player can see all of the exiled cards and may play them. Once a player looks at a face-down exiled card, that player may look at that card any time later in the game.",
                "The Oneiromancer doesn’t change when you can cast the exiled card. For example, if you exile a creature card without flash, you can cast it only during your main phase when the stack is empty.",
                "Because you’re already casting the cards using an alternative cost (by casting them without paying their mana costs), you can’t pay any other alternative costs for the cards, including casting them face down using the morph ability. You can pay additional costs, such as kicker costs. If the cards have any mandatory additional costs, you must pay those.",
                "If a card has {X} in its mana cost, you must choose 0 as the value for X when casting it.",
                "Any cards you don’t cast this way will remain in exile.",
                "Casting the card causes it to leave exile. You can’t cast it multiple times.",
                "If you leave the game, the cards remain exiled face down indefinitely. No player may look at them."
            ]
        },
        {
            "id": 27,
            "name": "The Puppet Master",
            "name_anchor": "the-puppet-master",
            "uri": "https://mtgtreachery.net/rules/oracle/?card=the-puppet-master",
            "cost": "",
            "cmc": 0,
            "color": "black",
            "type": "Identity — Traitor",
            "types": {
                "supertype": "Identity",
                "subtype": "Traitor"
            },
            "rarity": "S",
            "text": "Unveil {6}|When The Puppet Master is unveiled, redistribute control of any number of other identity cards. Then turn face down each of those cards that isn’t a Leader. (Each player must control one identity card.)|You may look at face-down identity cards you don’t control any time.|At the beginning of your end step, draw two cards.",
            "flavor": "",
            "artist": "fuuryoku (Thom Scott) @ DeviantArt",
            "rulings": [
                "Other players can respond to The Puppet Master’s unveiling triggered ability. They can use their own Identity’s unveil ability while they have priority. Afterwards, those identity cards will be turned face down during the resolution of The Puppet Master’s ability.",
                "Once The Puppet Master’s unveiling triggered ability begins to resolve, no player may take other actions until it’s done. Notably, opponents won’t be allowed to unveil their identity card.",
                "You choose which player gets which identity card when the unveiling triggered ability resolves, except for the control of The Puppet Master identity card who cannot change this way.When The Puppet Master’s unveiling triggered ability starts to resolve, for each other player, you can choose to (a) leave their identity card as they are or (b) exchange control of that identity with another one (not being The Puppet Master). You can’t choose to have a player controls no identity card.",
                "You may look at face-down identity cards during the resolution of the unveiling triggered ability.If a player concedes during the resolution of The Puppet Master’s unveiling triggered ability, their identity card leaves the game and no one gains control of it. If that player would have gained control of another identity card, instead assign that identity card to another player with no identity card assigned.",
                "The Puppet Master’s last ability can trigger only while the identity card is face up.",
                "Each player is changing team according to their new role."
            ]
        },
        {
            "id": 28,
            "name": "The Reflector",
            "name_anchor": "the-reflector",
            "uri": "https://mtgtreachery.net/rules/oracle/?card=the-reflector",
            "cost": "",
            "cmc": 0,
            "color": "black",
            "type": "Identity — Traitor",
            "types": {
                "supertype": "Identity",
                "subtype": "Traitor"
            },
            "rarity": "R",
            "text": "Unveil {5}|When The Reflector is unveiled, gain control of target ability, instant, or sorcery spell. You may choose new targets for it. Then copy that spell or ability for each opponent. You may choose new targets for the copies.",
            "flavor": "",
            "artist": "LeeJJ (Jon Lee) @ DeviantArt",
            "rulings": [
                "The Reflector’s unveiling triggered ability can target any instant or sorcery spell, or ability on the stack, even one without targets. Static abilities of objects can’t be targeted.",
                "If you gain control of an instant or sorcery spell, it will be put into its owner’s graveyard as it resolves.",
                "If you gain control of an instant or sorcery spell for which a Buyback cost has been paid, the card returns to its owner’s hand.",
                "You may change any or none of the spell’s targets. If you change a target, you must choose a legal target for the spell. If you can’t, you must leave the target unchanged (even if the current target is illegal). Notably, if you were originally chosen as a \"target opponent\" for a spell you gain control with The Reflector, you are now an illegal target as you aren’t your own opponent.",
                "If the target is removed from the stack (e.g. countered) before the unveiling ability resolves, The Reflector will fizzle and do nothing as it is its only target."
            ]
        },
        {
            "id": 29,
            "name": "The Time Bender",
            "name_anchor": "the-time-bender",
            "uri": "https://mtgtreachery.net/rules/oracle/?card=the-time-bender",
            "cost": "",
            "cmc": 0,
            "color": "black",
            "type": "Identity — Traitor",
            "types": {
                "supertype": "Identity",
                "subtype": "Traitor"
            },
            "rarity": "R",
            "text": "Unveil {6}|When The Time Bender is unveiled, choose two —|• Each player shuffles their hand and graveyard into their library, thendraws seven cards.|• Take an extra turn after this one.|• End the turn.",
            "flavor": "",
            "artist": "Bob Khel",
            "rulings": [
                "If multiple \"extra turn\" effects resolve in the same turn, take them in the reverse of the order that the effects resolved.",
                "If any abilities trigger while players are shuffling cards into their library or drawing seven cards, those abilities cease to exist when the turn ends. They won’t be put on the stack.",
                "Ending the turn this way means the following things happen in order: 1) All spells and abilities on the stack are exiled. This includes spells and abilities that can’t be countered. 2) If there are any attacking and blocking creatures, they’re removed from combat. 3) State-based actions are checked. No player gets priority, and no triggered abilities are put onto the stack. 4) The current phase and/or step ends. The game skips straight to the cleanup step. 5) The cleanup step happens in its entirety.",
                "If any triggered abilities do trigger during this process, they’re put onto the stack during the cleanup step. If this happens, players will have a chance to cast spells and activate abilities, then there will be another cleanup step before the turn is over.",
                "Though other spells and abilities that are exiled won’t get a chance to resolve, they don’t count as being countered.",
                "Any \"at the beginning of the next end step\" triggered abilities won’t get the chance to trigger that turn because the end step is skipped. Those abilities will trigger at the beginning of the end step of the next turn.",
                "If both your hand and graveyard are empty as The Time Bender’s unveiling triggered ability starts resolving, you’ll still shuffle your library before drawing seven cards."
            ]
        },
        {
            "id": 30,
            "name": "The Treacherous Masochist",
            "name_anchor": "the-treacherous-masochist",
            "uri": "https://mtgtreachery.net/rules/oracle/?card=the-treacherous-masochist",
            "cost": "",
            "cmc": 0,
            "color": "black",
            "type": "Identity — Traitor",
            "types": {
                "supertype": "Identity",
                "subtype": "Traitor"
            },
            "rarity": "S",
            "text": "Unveil {0}|If you would be the first player to lose the game, or tied for first, instead you win the game. (You still win the game if you are the last player standing.)|As long as no player has lost the game, spells and abilities you control can’t cause you to lose the game, and you can’t pay life.",
            "flavor": "",
            "artist": "Roman Baramzin @ ArtStation",
            "rulings": [
                "The Treacherous Masochist’s second ability is a replacement effect that affects the game only while the identity card is face up. If you are the first player to lose the game and the identity card is face down, you won’t win the game.",
                "The Treacherous Masochist’s replacement effect does nothing if you concede the game. A player who concedes leaves the game.",
                "If you can’t lose the game (for example, you control a Platinum Angel), The Treacherous Masochist won’t do anything.",
                "If a spell or an activated ability has a cost that requires you to pay life, that spell or ability can’t be cast or activated.",
                "Other things may cause you to pay life, such as during the resolution of a spell or an ability. You cannot pay life for those too.",
                "Players may always pay 0 life, even if an effect says they can’t pay life."
            ]
        },
        {
            "id": 31,
            "name": "The Wearer of Masks",
            "name_anchor": "the-wearer-of-masks",
            "uri": "https://mtgtreachery.net/rules/oracle/?card=the-wearer-of-masks",
            "cost": "",
            "cmc": 0,
            "color": "black",
            "type": "Identity — Traitor",
            "types": {
                "supertype": "Identity",
                "subtype": "Traitor"
            },
            "rarity": "S",
            "text": "Unveil {X}|As The Wearer of Masks is unveiled, reveal up to X non-Leader identity cards at random from outside the game. You may choose one of them. If you do, until The Wearer of Masks is turned face down, it becomes a copy of that card, except it’s a Traitor. (It loses all other identity types.)",
            "flavor": "",
            "artist": "moonxels (David Demaret) @ DeviantArt",
            "rulings": [
                "To choose some non-Leader identity cards at random, you may for example shuffle the remaining ones from outside the game in a face-down pile, then reveal the top cards of that pile. If you don’t want to shuffle all your remaining identity cards as it can be a logistical nightmare, you can also use a die roll on a small subset of cards, or any other clear and mutually agreeable method.",
                "The Wearer of Masks’ ability to become a copy is a replacement effect. Because turning an identity face up and applying replacement effects both don’t use the stack, players won’t be able to take actions between the time you announce that you’re turning The Wearer of Masks face up and the time it has become a copy of the identity of your choice.",
                "Any \"When [this identity] is unveiled\" or \"As [this identity] is unveiled\" abilities of the copied identity card will trigger and apply if The Wearer of Masks is unveiled.",
                "If the copied identity card has an X in its abilities, X is 0.",
                "The Wearer of Masks stays a Traitor. It cannot become another identity type this way.",
                "When The Wearer of Masks is turned face down, its copy effect wears off. While it’s face down, it’s a Traitor identity card that can be turned face up for an unveil cost of {X}."
            ]
        },
        {
            "id": 32,
            "name": "The Ambitious Queen",
            "name_anchor": "the-ambitious-queen",
            "uri": "https://mtgtreachery.net/rules/oracle/?card=the-ambitious-queen",
            "cost": "",
            "cmc": 0,
            "color": "red",
            "type": "Identity — Assassin",
            "types": {
                "supertype": "Identity",
                "subtype": "Assassin"
            },
            "rarity": "U",
            "text": "Unveil—Pay 1 life, Exile a nonland card from your hand. (Start the game with this identity face down in the command zone. Turn it face up any time for its unveil cost.)|When The Ambitious Queen is unveiled, counter target noncreature spell.",
            "flavor": "",
            "artist": "88grzes (Grzegorz Rutkowski) @ DeviantArt",
            "rulings": [
                "You can’t pay the unveil cost if you have no cards in hand or if your life total is less than 1."
            ]
        },
        {
            "id": 33,
            "name": "The Beastmaster",
            "name_anchor": "the-beastmaster",
            "uri": "https://mtgtreachery.net/rules/oracle/?card=the-beastmaster",
            "cost": "",
            "cmc": 0,
            "color": "red",
            "type": "Identity — Assassin",
            "types": {
                "supertype": "Identity",
                "subtype": "Assassin"
            },
            "rarity": "U",
            "text": "Unveil {4} (Start the game with this identity face down in the command zone. Turn it face up any time for its unveil cost.)|When The Beastmaster is unveiled, up to two target players each create two 4/4 red and green Beast creature tokens with trample.",
            "flavor": "",
            "artist": "Smolin (Nick Avallone) @ DeviantArt",
            "rulings": [
                "No extra rules information."
            ]
        },
        {
            "id": 34,
            "name": "The Bio-Engineer",
            "name_anchor": "the-bio-engineer",
            "uri": "https://mtgtreachery.net/rules/oracle/?card=the-bio-engineer",
            "cost": "",
            "cmc": 0,
            "color": "red",
            "type": "Identity — Assassin",
            "types": {
                "supertype": "Identity",
                "subtype": "Assassin"
            },
            "rarity": "M",
            "text": "Unveil—Sacrifice a nontoken permanent.|When The Bio-Engineer is unveiled, you get {a}{a}{a}{a}{a}{a} (six nut counters).|{1}, Pay {a}: Put a +1/+1 counter on target creature. That creature becomes an artifact in addition to its other types.|{2}, Pay {a}{a}: Gain control of target artifact.",
            "flavor": "",
            "artist": "Ushihachi",
            "rulings": [
                "The Bio-Engineer’s third and fourth abilities can be activated only while the identity card is face up.",
                "It’s the ability, not the counter that makes the creature an artifact. The creature remains an artifact even if the +1/+1 counter is removed.",
                "The effect of The Bio-Engineer’s fourth ability last indefinitely. You won’t lose control of the permanents if you lose control of The Bio-Engineer or if it’s turned face down.",
                "If you gain control of a permanent, and you leave the game, the control-changing effect will end. Unless there’s another control-changing effect affecting that permanent, it will return to its owner’s control.",
                "If you gain control of a permanent another player owns, and that player leaves the game, the permanent will also leave the game.",
                "{a} is the nut symbol. It represents one nut counter.",
                "Nut counters are a kind of counter that a player may have. They’re not associated with specific permanents. (Other kinds of counters that players may have include poison, energy and experience.)",
                "Keep careful track of how many nut counters the player has. You may do so by keeping a running count on paper, by using a die on that card, or by any other clear and mutually agreeable method.",
                "If an effect says you get one or more {a}, you get that many nut counters. To pay one or more {a}, you lose that many nut counters. Any effects that interact with counters a player gets, has, or loses can interact with nut counters.",
                "Nut counters aren’t mana. They don’t go away as steps, phases, and turns end, and effects that add mana \"of any type\" to your mana pool can’t give you nut counters.",
                "You can’t pay more nut counters than you have."
            ]
        },
        {
            "id": 35,
            "name": "The Chaos Wielder",
            "name_anchor": "the-chaos-wielder",
            "uri": "https://mtgtreachery.net/rules/oracle/?card=the-chaos-wielder",
            "cost": "",
            "cmc": 0,
            "color": "red",
            "type": "Identity — Assassin",
            "types": {
                "supertype": "Identity",
                "subtype": "Assassin"
            },
            "rarity": "U",
            "text": "Unveil {2} (Start the game with this identity face down in the command zone. Turn it face up any time for its unveil cost.)|When The Chaos Wielder is unveiled, choose a card type. Until end of turn, spells you cast of the chosen type have cascade.",
            "flavor": "",
            "artist": "ericbraddock @ DeviantArt",
            "rulings": [
                "Cascade triggers when you cast the spell, meaning that it resolves before that spell. If you end up casting the exiled card, it will go on the stack above the spell with cascade.",
                "When the cascade ability resolves, you must exile cards. The only optional part of the ability is whether or not you cast the last card exiled.",
                "If a spell with cascade is countered, the cascade ability will still resolve normally.",
                "You exile the cards face up. All players will be able to see them.",
                "If you cast a card \"without paying its mana cost,\" you can’t choose to cast it for any alternative costs. You can, however, pay additional costs. If the card has any mandatory additional costs, you must pay those to cast the card.",
                "If the card has {X} in its mana cost, you must choose 0 as the value of X when casting it without paying its mana cost.",
                "Due to a 2021 rules change to cascade, not only do you stop exiling cards if you exile a nonland card with lesser mana value than the spell with cascade, but the resulting spell you cast must also have lesser mana value. Previously, in cases where a card’s mana value differed from the resulting spell, such as with some modal double-faced cards or cards with an Adventure, you could cast a spell with a higher mana value than the exiled card.",
                "The mana value of a split card is determined by the combined mana cost of its two halves. If cascade allows you to cast a split card, you may cast either half but not both halves."
            ]
        },
        {
            "id": 36,
            "name": "The Corpse Snatcher",
            "name_anchor": "the-corpse-snatcher",
            "uri": "https://mtgtreachery.net/rules/oracle/?card=the-corpse-snatcher",
            "cost": "",
            "cmc": 0,
            "color": "red",
            "type": "Identity — Assassin",
            "types": {
                "supertype": "Identity",
                "subtype": "Assassin"
            },
            "rarity": "R",
            "text": "Unveil {4}|When The Corpse Snatcher is unveiled, each player mills two cards. When one or more cards are milled this way, put a creature card from a graveyard onto the battlefield under target player’s control. That creature is a black Zombie in addition to its other colors and types.",
            "flavor": "",
            "artist": "rk post",
            "rulings": [
                "The Corpse Snatcher features a reflexive trigger. When it’s unveiled, its triggered ability goes on the stack without a target. When that ability finished resolving, a second ability triggers and you pick a target player that will get a reanimated creature. Players may cast spells and activate abilities before they are milled and then again after they are milled but before a creature is reanimated.",
                "The Corpse Snatcher’s reanimating triggered ability doesn’t target a creature card. You choose which card you’re putting onto the battlefield as it resolves. You can choose any creature card in a graveyard at that time, including one just put into a graveyard by The Corpse Snatcher. If there are no creature cards in graveyards at that time, The Corpse Snatcher simply finishes resolving."
            ]
        },
        {
            "id": 37,
            "name": "The Demon",
            "name_anchor": "the-demon",
            "uri": "https://mtgtreachery.net/rules/oracle/?card=the-demon",
            "cost": "",
            "cmc": 0,
            "color": "red",
            "type": "Identity — Assassin",
            "types": {
                "supertype": "Identity",
                "subtype": "Assassin"
            },
            "rarity": "U",
            "text": "Unveil {4} (Start the game with this identity face down in the command zone. Turn it face up any time for its unveil cost.)|When The Demon is unveiled, target player searches their library for a card, puts that card into their hand, then shuffles.",
            "flavor": "",
            "artist": "KipcaHT @ DeviantArt",
            "rulings": [
                "Although the targeted player doesn’t need to find a card if they don’t want to, that player must shuffle their library."
            ]
        },
        {
            "id": 38,
            "name": "The Depths Caller",
            "name_anchor": "the-depths-caller",
            "uri": "https://mtgtreachery.net/rules/oracle/?card=the-depths-caller",
            "cost": "",
            "cmc": 0,
            "color": "red",
            "type": "Identity — Assassin",
            "types": {
                "supertype": "Identity",
                "subtype": "Assassin"
            },
            "rarity": "M",
            "text": "Unveil {X}{3}|When The Depths Caller is unveiled, choose a permanent type and tap any number of untapped permanents of that type you control. Search your library for a card of the chosen type with mana value no more than X plus the number of permanents tapped this way, put it onto the battlefield tapped, then shuffle.",
            "flavor": "",
            "artist": "Gerald Brom",
            "rulings": [
                "The X in the unveiling triggered ability has the same value as the X paid in the Unveil ability. This is pretty easy to derive since there is no other source of X.",
                "Once The Depths Caller’s unveiling triggered ability begins to resolve, no players may take other actions until it’s done. Notably, players can’t try to destroy your permanents after you’ve chosen a type.",
                "If a card in a player’s library has {X} in its mana cost, X is considered to be 0.",
                "You can tap any untapped creature you control, even one you haven’t controlled continuously since the beginning of your most recent turn.",
                "Tapping an untapped creature that’s attacking or blocking won’t cause that creature to stop attacking or blocking.",
                "Tapping an artifact won’t cause its abilities to stop applying unless those abilities say so.",
                "Equipment attached to a creature doesn’t become tapped when that creature becomes tapped, and tapping that Equipment doesn’t cause the creature to become tapped."
            ]
        },
        {
            "id": 39,
            "name": "The Madwoman",
            "name_anchor": "the-madwoman",
            "uri": "https://mtgtreachery.net/rules/oracle/?card=the-madwoman",
            "cost": "",
            "cmc": 0,
            "color": "red",
            "type": "Identity — Assassin",
            "types": {
                "supertype": "Identity",
                "subtype": "Assassin"
            },
            "rarity": "R",
            "text": "Unveil {4}|When The Madwoman is unveiled, tap up to two target creatures. Each of those creatures deals damage equal to its power to its controller. Prevent all combat damage that would be dealt to and dealt by those creatures this turn.",
            "flavor": "",
            "artist": "Anna Ignatieva",
            "rulings": [
                "Tapping a creature is part of the effect, therefore you can target a tapped creature."
            ]
        },
        {
            "id": 40,
            "name": "The Necromancer",
            "name_anchor": "the-necromancer",
            "uri": "https://mtgtreachery.net/rules/oracle/?card=the-necromancer",
            "cost": "",
            "cmc": 0,
            "color": "red",
            "type": "Identity — Assassin",
            "types": {
                "supertype": "Identity",
                "subtype": "Assassin"
            },
            "rarity": "R",
            "text": "Unveil {6}|When The Necromancer is unveiled, if it’s your turn, for each player, you may put up to one target creature card from that player’s graveyard onto the battlefield under your control.",
            "flavor": "",
            "artist": "Athayar (Nicolas Vallée) @ DeviantArt",
            "rulings": [
                "You can choose a number of targets up to the number of players in the game, one target per player (including you).",
                "The creature cards enter the battlefield simultaneously."
            ]
        },
        {
            "id": 41,
            "name": "The Physician",
            "name_anchor": "the-physician",
            "uri": "https://mtgtreachery.net/rules/oracle/?card=the-physician",
            "cost": "",
            "cmc": 0,
            "color": "red",
            "type": "Identity — Assassin",
            "types": {
                "supertype": "Identity",
                "subtype": "Assassin"
            },
            "rarity": "R",
            "text": "Unveil {X}|When The Physician is unveiled, any number of target players each get twice X plus four rad counters. (At the beginning of those player’s precombat main phase, if they have any rad counters, they mill that many cards. For each nonland card milled this way, they lose 1 life and a rad counter.)",
            "flavor": "",
            "artist": "gameriuxlt @ DeviantArt",
            "rulings": [
                "The X in the unveiling triggered ability has the same value as the X paid in the Unveil ability. This is pretty easy to derive since there is no other source of X.",
                "You add the four rad counters after multiplying X. E.g. if X is 3, all targeted players get 2×3+4 = 6+4 = 10 rad counters.",
                "Rad counters are a kind of counter that a player may have. They’re not associated with any specific permanents.",
                "Keep track of how many rad counters each player has. Potential ways to track this include writing them down on paper or using dice, but any method that is clear and mutually agreeable is fine.",
                "Rad counters don’t go away as steps, phases, or turns end. They only go away when an effect instructs a player to remove rad counters from themselves.",
                "There is an inherent triggered ability associated with having rad counters. This triggered ability has no source and is controlled by the active player. The full text of this ability is \"At the beginning of the precombat main phase of a player with rad counters, that player mills cards equal to the number of rad counters they have. For each nonland card milled this way, that player loses 1 life and removes one rad counter from themselves.\"",
                "In a game using the shared team turns option, such as an Archenemy or Two-Headed Giant game, the inherent triggered ability associated with rad counters triggers once for each player on the active team that has rad counters. Each instance of that ability is controlled by one of those players.",
                "Any effects (such as proliferate) that interact with counters a player gets, has, or loses can interact with rad counters.",
                "The cards are milled all at once, which means abilities that trigger \"whenever one or more nonland cards are milled\" will trigger exactly once as long as at least one nonland card was milled.",
                "If a player has fewer cards remaining in their library than the number of rad counters they have when the triggered ability resolves, they’ll mill as many cards as they can."
            ]
        },
        {
            "id": 42,
            "name": "The Pyromancer",
            "name_anchor": "the-pyromancer",
            "uri": "https://mtgtreachery.net/rules/oracle/?card=the-pyromancer",
            "cost": "",
            "cmc": 0,
            "color": "red",
            "type": "Identity — Assassin",
            "types": {
                "supertype": "Identity",
                "subtype": "Assassin"
            },
            "rarity": "R",
            "text": "Unveil {6}|When The Pyromancer is unveiled, if it’s your turn, it deals 6 damage to target player and each creature and planeswalker they control. If a creature is dealt damage this way, it loses indestructible until end of turn.",
            "flavor": "",
            "artist": "Andantonius (Jon Neimeister) @ DeviantArt",
            "rulings": [
                "If The Pyromancer doesn’t deal damage to a creature (perhaps because that damage was prevented), neither additional effect will apply. It won’t lose indestructible.",
                "Creatures with indestructible that enter the battlefield after The Pyromancer’s unveiling triggered ability resolves will still have indestructible.",
                "Once The Pyromancer’s unveiling triggered ability begins to resolve, no player may take actions until it’s done. Notably, players can’t try to give a creature indestructible again to save it from the damage.",
                "An identity card has no color."
            ]
        },
        {
            "id": 43,
            "name": "The Rebel General",
            "name_anchor": "the-rebel-general",
            "uri": "https://mtgtreachery.net/rules/oracle/?card=the-rebel-general",
            "cost": "",
            "cmc": 0,
            "color": "red",
            "type": "Identity — Assassin",
            "types": {
                "supertype": "Identity",
                "subtype": "Assassin"
            },
            "rarity": "R",
            "text": "Unveil {5}|When The Rebel General is unveiled, if it’s your turn, for each non-Leader player, gain control of up to one target permanent that player controls until end of turn. Untap those permanents. They gain haste until end of turn.",
            "flavor": "",
            "artist": "larbesta @ DeviantArt",
            "rulings": [
                "Gaining control of a creature doesn’t cause you to gain control of any Auras or Equipment attached to it. However, if you gain control of a creature enchanted by an Aura with totem armor and that creature would be destroyed that turn, instead the Aura will be destroyed and the creature will survive."
            ]
        },
        {
            "id": 44,
            "name": "The Seer",
            "name_anchor": "the-seer",
            "uri": "https://mtgtreachery.net/rules/oracle/?card=the-seer",
            "cost": "",
            "cmc": 0,
            "color": "red",
            "type": "Identity — Assassin",
            "types": {
                "supertype": "Identity",
                "subtype": "Assassin"
            },
            "rarity": "U",
            "text": "Unveil {X} (Start the game with this identity face down in the command zone. Turn it face up any time for its unveil cost.)|When The Seer is unveiled, shuffle, then scry X. Reveal the top card of your library and put it into your hand. When you reveal a nonland card this way, The Seer deals damage equal to twice that card’s mana value to any target.",
            "flavor": "",
            "artist": "DM7 (Martin MeKenzie) @ DeviantArt",
            "rulings": [
                "The Seer’s unveiling triggered ability goes on the stack without a target. When you reveal a nonland card during its resolution, its reflexive triggered ability triggers and you pick a target to be dealt damage. You’ll know the mana value of the revealed nonland card and how much damage will be dealt as you choose your target.",
                "The X in the unveiling triggered ability has the same value as the X paid in the Unveil ability. This is pretty easy to derive since there is no other source of X.",
                "If X is 0, you won’t scry at all. Any abilities that trigger whenever you scry won’t trigger.",
                "Once The Seer’s unveiling triggered ability begins to resolve, no player may take other actions until it’s done. Notably, opponents can’t try to change your library after you scry but before you reveal the top card of your library.",
                "If the revealed card in your library has {X} in its mana cost, X is considered to be 0.",
                "The converted mana cost of a split card is based on the combined mana cost of its two halves.",
                "An identity card has no color."
            ]
        },
        {
            "id": 45,
            "name": "The Shapeshifting Slayer",
            "name_anchor": "the-shapeshifting-slayer",
            "uri": "https://mtgtreachery.net/rules/oracle/?card=the-shapeshifting-slayer",
            "cost": "",
            "cmc": 0,
            "color": "red",
            "type": "Identity — Assassin",
            "types": {
                "supertype": "Identity",
                "subtype": "Assassin"
            },
            "rarity": "M",
            "text": "Unveil {5}|When The Shapeshifting Slayer is unveiled, if it’s your turn, choose a creature on the battlefield or a creature card in any zone other than a player’s hand or library. Create a token that’s a copy of it. That token gains menace, trample, and haste.",
            "flavor": "",
            "artist": "Matjosh (Andrius Matijosius) @ DeviantArt",
            "rulings": [
                "The Shapeshifting Slayer unveiling triggered ability doesn’t target the chosen creature.",
                "Other zones are graveyard, battlefield, stack, exile, ante, and command.",
                "As the token is created, it checks the printed values of the creature it’s copying — or, if that creature is itself a token, the original characteristics of that token as stated by the effect that put it onto the battlefield — as well as any copy effects that have been applied to it. It won’t copy counters on the creature, nor will it copy other effects that have changed the creature’s power, toughness, types, color, or so on.",
                "If the copied creature has {X} in its mana cost, that X is considered to be 0.",
                "If the chosen creature is copying something else (for example, if the chosen creature is a Clone), then the Shapeshifting’s token enters the battlefield as whatever the chosen creature copied.",
                "If the chosen creature is a token, the Shapeshifting’s token copies the original characteristics of that token as stated by the effect that put the token onto the battlefield.",
                "Any enters-the-battlefield abilities of the copied creature will trigger when the Shapeshifting’s token enters the battlefield. Any \"as [this creature] enters the battlefield\" or \"[this creature] enters the battlefield with\" abilities of the chosen creature will also work."
            ]
        },
        {
            "id": 46,
            "name": "The Sigil Mage",
            "name_anchor": "the-sigil-mage",
            "uri": "https://mtgtreachery.net/rules/oracle/?card=the-sigil-mage",
            "cost": "",
            "cmc": 0,
            "color": "red",
            "type": "Identity — Assassin",
            "types": {
                "supertype": "Identity",
                "subtype": "Assassin"
            },
            "rarity": "U",
            "text": "Unveil {5} (Start the game with this identity face down in the command zone. Turn it face up any time for its unveil cost.)|When The Sigil Mage is unveiled, you may cast up to two target instant or sorcery cards from graveyards without paying their mana costs.",
            "flavor": "",
            "artist": "Peter Orullian",
            "rulings": [
                "The instant or sorcery cards may come from different graveyards.",
                "You cast the cards one at a time, choosing modes, targets and so on. The last card you cast will be the first one to resolve.",
                "When casting an instant or sorcery card this way, ignore timing restrictions based on the card’s type. Other timing restrictions, such as \"Cast [this card] only during combat,\" must be followed.",
                "If you can’t cast one of the target instant or sorcery cards, perhaps because there are no legal targets available, or if you choose not to cast one, it will remain in its owner’s graveyard.",
                "If you cast a card \"without paying its mana cost,\" you can’t pay alternative costs such as overload costs. You can pay additional costs such as kicker costs. If the card has mandatory additional costs, you must pay those.",
                "If a card has {X} in its mana cost, you must choose 0 as its value.",
                "If an instant or sorcery card you cast this way is countered, it will still be exiled.",
                "If you cast an instant or sorcery spell with cipher this way, you may exile the card encoded on a creature you control. If you can’t, or if you choose not to, the card will end up exiled but not encoded on a creature.",
                "If an instant or sorcery card you cast this way goes to a zone other than exile or a graveyard, perhaps because one of its abilities says to put it into its owner’s hand, it won’t be exiled. This is true even if the card would be put into a graveyard later that turn."
            ]
        },
        {
            "id": 47,
            "name": "The Sorceress",
            "name_anchor": "the-sorceress",
            "uri": "https://mtgtreachery.net/rules/oracle/?card=the-sorceress",
            "cost": "",
            "cmc": 0,
            "color": "red",
            "type": "Identity — Assassin",
            "types": {
                "supertype": "Identity",
                "subtype": "Assassin"
            },
            "rarity": "U",
            "text": "Unveil {3} (Start the game with this identity face down in the command zone. Turn it face up any time for its unveil cost.)|When The Sorceress is unveiled, you may choose new targets for target instant or sorcery spell. Then copy that spell. You may choose new targets for the copy.",
            "flavor": "",
            "artist": "Bluefley (Marc Brunet)",
            "rulings": [
                "The Sorceress’ unveiling triggered ability can target (and copy) any instant or sorcery spell, not just one with targets. It doesn’t matter who controls it.",
                "When the unveiling triggered ability resolves, it creates a copy of a spell. You control the copy. The controller of the original spell retains control of that spell. The copy is created on the stack, so it’s not \"cast.\" Abilities that trigger when a player casts a spell won’t trigger. The copy will then resolve like a normal spell, after players get a chance to cast spells and activate abilities. The copy resolves before the original spell.",
                "The copy will have the same targets as the spell it’s copying unless you choose new ones. You may change any number of the targets, including all of them or none of them. If, for one of the targets, you can’t choose a new legal target, then it remains unchanged (even if the current target is illegal).",
                "If the spell The Sorceress copies is modal (that is, it says \"Choose one —\" or the like), the copy will have the same mode. You can’t choose a different one.",
                "If the spell The Sorceress copies has an X whose value was determined as it was cast (like Fireball does), the copy has the same value of X.",
                "You can’t choose to pay any additional costs for the copy. However, effects based on any additional costs that were paid for the original spell are copied as though those same costs were paid for the copy too. For example, if a player sacrifices a 3/3 creature to cast Fling, and you copy it with The Sorceress, the copy of Fling will also deal 3 damage to its target.",
                "If the copy says that it affects \"you,\" it affects the controller of the copy, not the controller of the original spell. Similarly, if the copy says that it affects an \"opponent,\" it affects an opponent of the copy’s controller, not an opponent of the original spell’s controller."
            ]
        },
        {
            "id": 48,
            "name": "The Villain",
            "name_anchor": "the-villain",
            "uri": "https://mtgtreachery.net/rules/oracle/?card=the-villain",
            "cost": "",
            "cmc": 0,
            "color": "red",
            "type": "Identity — Assassin",
            "types": {
                "supertype": "Identity",
                "subtype": "Assassin"
            },
            "rarity": "R",
            "text": "Unveil {5}|When The Villain is unveiled, if it’s your turn, target opponent faces a villainous choice — They sacrifice half the nonland permanents they control, rounded up, or they lose half their life, rounded up. At the beginning of your next upkeep, they face that choice an additional time. (They can make the same or different choices.)",
            "flavor": "",
            "artist": "sbraithwaite @ DeviantArt",
            "rulings": [
                "When a player faces a villainous choice, they first choose one of the two options, then all actions in the chosen option are performed.",
                "A player facing a villainous choice can always choose either option, even if one or both of the options are impossible. For example, if one of the options is to sacrifice a creature, a player who controls no creatures can still choose that option.",
                "If a player attempts to halve a negative life total, they halve 0. This means that the life total stays the same. A life total of -10 would remain -10.",
                "All abilities that trigger while The Villain’s unveiling triggered ability is resolving are put on the stack after it is finished resolving. All such abilities controlled by the player whose turn it is are put on the stack first, then those controlled by the next player in turn order, and so on. For each player, they can put their abilities on the stack in the order of their choice. Abilities don’t have to be put on the stack in the order in which they triggered."
            ]
        },
        {
            "id": 49,
            "name": "The War Shaman",
            "name_anchor": "the-war-shaman",
            "uri": "https://mtgtreachery.net/rules/oracle/?card=the-war-shaman",
            "cost": "",
            "cmc": 0,
            "color": "red",
            "type": "Identity — Assassin",
            "types": {
                "supertype": "Identity",
                "subtype": "Assassin"
            },
            "rarity": "R",
            "text": "Unveil {5}|When The War Shaman is unveiled, destroy up to two target nonland permanents. If none of them were creatures, create an X/X red Elemental creature token, where X is the total mana value of the permanents destroyed this way.",
            "flavor": "",
            "artist": "Bob Khel @ DeviantArt",
            "rulings": [
                "The War Shaman’s unveiling triggered ability is countered and you get no token if the permanents are illegal targets on resolution."
            ]
        },
        {
            "id": 50,
            "name": "The Blood Empress",
            "name_anchor": "the-blood-empress",
            "uri": "https://mtgtreachery.net/rules/oracle/?card=the-blood-empress",
            "cost": "",
            "cmc": 0,
            "color": "multicolor",
            "type": "Identity — Leader",
            "types": {
                "supertype": "Identity",
                "subtype": "Leader"
            },
            "rarity": "U",
            "text": "(Start the game with this identity face up in the command zone. You are the starting player.)|Whenever one or more creatures your opponents control leave the battlefield, choose two. This ability triggers only once each turn.|• Create a 0/1 black Thrull creature token.|• Create two Blood tokens.|• Tap or untap target permanent.|• Target opponent loses 2 life and you gain 2life.",
            "flavor": "",
            "artist": "rkpost",
            "rulings": [
                "If multiple creatures leave the battlefield at the same time, The Blood Empress’s ability will trigger only once."
            ]
        },
        {
            "id": 51,
            "name": "The Chaos Bringer",
            "name_anchor": "the-chaos-bringer",
            "uri": "https://mtgtreachery.net/rules/oracle/?card=the-chaos-bringer",
            "cost": "",
            "cmc": 0,
            "color": "multicolor",
            "type": "Identity — Leader",
            "types": {
                "supertype": "Identity",
                "subtype": "Leader"
            },
            "rarity": "M",
            "text": "At the beginning of your end step, roll a six-sided die, then roll again for each player who has lost the game.|1 — Create a 0/1 white Goat creature token.|2 or 3 — Scry X, where X is the result.|4 or 5 — Create your choice of a Clue token, a Food token, or a Treasure token.|6 — Create a Clue token, a Food token, and a Treasure token.",
            "flavor": "",
            "artist": "One Vox",
            "rulings": [
                "The Chaos Bringer’s triggered ability counts every player who has lost, no matter how the player lost the game: due to a state-based action (having 0 or less life, trying to draw a card from an empty library, having 10 or more poison counters), because of a spell or effect that states they lose the game, because your awesome might has left them with no choice other than concession, or for any other reason.",
                "You roll a die as The Chaos Bringer’s ability resolves. No player may take actions between seeing the result of the roll and completing the ability’s resolution. No player gets priority between each die’s resolution.",
                "You apply each die’s result independently (you don’t add them together)."
            ]
        },
        {
            "id": 52,
            "name": "The Corrupted Regent",
            "name_anchor": "the-corrupted-regent",
            "uri": "https://mtgtreachery.net/rules/oracle/?card=the-corrupted-regent",
            "cost": "",
            "cmc": 0,
            "color": "multicolor",
            "type": "Identity — Leader",
            "types": {
                "supertype": "Identity",
                "subtype": "Leader"
            },
            "rarity": "R",
            "text": "(Start the game with this identity face up in the command zone. You are the starting player.)|At the beginning of your draw step, you may draw an additional card. If you do, choose a card in your hand drawn this turn. Pay 3 life or put that card on top of your library.",
            "flavor": "",
            "artist": "ArchLimit (Leo Li) @ DeviantArt",
            "rulings": [
                "You always perform your normal draw before this ability. The normal draw occurs before anything can be placed on the stack during a player’s draw step.",
                "If you control other triggered abilities that allow you to draw cards during your draw step, you can choose to order The Corrupted Regent’s ability before or after those abilities. Triggered abilities controlled by other players will resolve before triggered abilities you control.",
                "Any cards drawn prior to The Corrupted Regent’s ability resolving, including in your upkeep or in response to The Corrupted Regent’s triggered ability, can be chosen to be put back using this effect. The Corrupted Regent’s controller is responsible for keeping these cards distinguishable in hand, such as by keeping them separate from cards that began the turn in hand.",
                "You can put back zero or one card.",
                "If you choose to draw a card, then replace that draw with some other effect, the rest of The Corrupted Regent’s ability still happens. If you’ve actually drawn only one card that turn, you must choose that card and either pay 3 life or put it on top of your library. If you haven’t actually drawn any cards that turn, the rest of the ability has no effect.",
                "It’s not possible to take any actions between drawing the cards and choosing a card. You can’t cast the cards you drew to avoid having a card to choose."
            ]
        },
        {
            "id": 53,
            "name": "The Debt Collector",
            "name_anchor": "the-debt-collector",
            "uri": "https://mtgtreachery.net/rules/oracle/?card=the-debt-collector",
            "cost": "",
            "cmc": 0,
            "color": "multicolor",
            "type": "Identity — Leader",
            "types": {
                "supertype": "Identity",
                "subtype": "Leader"
            },
            "rarity": "M",
            "text": "At the beginning of your upkeep, each player loses 1 life for each debt counter among identity cards they control. You gain life equal to the life lost this way.|At the beginning of your end step, target player other than you draws a card and puts a debt counter on an identity card they control.|Whenever a player loses the game, draw a card for each debt counter among identity cards they controlled.",
            "flavor": "",
            "artist": "Grafitart @ CGHUB",
            "rulings": [
                "The Debt Collector’s last ability will trigger no matter how a player loses the game: due to a state-based action (as a result of having a life total of 0 or less, trying to draw a card from an empty library, or having ten poison counters), a spell or ability that says that player loses the game, a concession, or a game loss awarded by a judge.",
                "In a multiplayer game using the limited range of influence option (such as a Grand Melee game), if a spell or ability says that you win the game, it instead causes all of your opponents within your range of influence to lose the game. This is another way by which The Debt Collector’s last ability can trigger.",
                "Turning an identity card face up or face down won’t remove the counters on it.",
                "Counters on identity cards cannot be proliferated because identity cards aren’t permanents."
            ]
        },
        {
            "id": 54,
            "name": "The Gathering",
            "name_anchor": "the-gathering",
            "uri": "https://mtgtreachery.net/rules/oracle/?card=the-gathering",
            "cost": "",
            "cmc": 0,
            "color": "multicolor",
            "type": "Identity — Leader",
            "types": {
                "supertype": "Identity",
                "subtype": "Leader"
            },
            "rarity": "M",
            "text": "At the beginning of your upkeep, you may choose one that hasn’t been chosen —|• White — Create four 1/1 white Soldier creature tokens.|• Blue — Scry 4, then draw two cards.|• Black — Return target creature card from your graveyard to the battlefield.|• Red — The Gathering deals 4 damage divided as you choose among any number of targets.|• Green — Destroy target noncreature permanent.",
            "flavor": "",
            "artist": "HarryBuddhaPalm (Justin Reed) @ DeviantArt",
            "rulings": [
                "You choose the mode as the triggered ability goes on the stack. You can choose a mode that requires targets only if there are legal targets available.",
                "If the ability is countered (either for having its target become illegal or because a spell or ability counters it), the mode chosen for that instance of the ability still counts as being chosen.",
                "The phrase \"that hasn’t been chosen\" refers only to that specific The Gathering.",
                "It doesn’t matter who has chosen any particular mode. For example, say you control The Gathering and have chosen the first three modes. If an opponent gains control of The Gathering, that player can choose only the fourth or fifth mode.",
                "In some very unusual situations, you may not be able to choose a mode, either because all modes have previously been chosen or the only remaining modes require targets and there are no legal targets available. In this case, the ability is simply removed from the stack with no effect.",
                "Keep careful track of which modes the Leader player has already chosen. You may do so by keeping a running count on paper, by using colored counters on that card, by using one basic land card of each color under that card, or by any other clear and mutually agreeable method.",
                "For the red mode, you choose how many targets the ability has and how the damage is divided as you put the ability on the stack. Each target must receive at least 1 damage. If some of the targets are illegal targets as the ability tries to resolve, the original division of damage still applies but no damage is dealt to the illegal targets. If all targets are illegal, the ability doesn’t resolve."
            ]
        },
        {
            "id": 55,
            "name": "Her Seedborn Highness",
            "name_anchor": "her-seedborn-highness",
            "uri": "https://mtgtreachery.net/rules/oracle/?card=her-seedborn-highness",
            "cost": "",
            "cmc": 0,
            "color": "multicolor",
            "type": "Identity — Leader",
            "types": {
                "supertype": "Identity",
                "subtype": "Leader"
            },
            "rarity": "U",
            "text": "(Start the game with this identity face up in the command zone. You are the starting player.)|Start the game with a number of seed counters on Her Seedborn Highness equal to the number of players.|{2}, Remove a seed counter from Her Seedborn Highness: Untap all permanents you control. Activate only once each turn.",
            "flavor": "",
            "artist": "Jason Engle @ DeviantArt",
            "rulings": [
                "Counters on identity cards cannot be proliferated because identity cards aren’t permanents."
            ]
        },
        {
            "id": 56,
            "name": "His Beloved Majesty",
            "name_anchor": "his-beloved-majesty",
            "uri": "https://mtgtreachery.net/rules/oracle/?card=his-beloved-majesty",
            "cost": "",
            "cmc": 0,
            "color": "multicolor",
            "type": "Identity — Leader",
            "types": {
                "supertype": "Identity",
                "subtype": "Leader"
            },
            "rarity": "M",
            "text": "At the beginning of your upkeep, starting with the next player in turn order, each non-Leader player may choose a nonenchantment, nontoken permanent they control and draw a card. For each player who does, gain control of that permanent and untap it. If no one does, you draw a card.",
            "flavor": "",
            "artist": "Armandeo @ Terminally Incoherent",
            "rulings": [
                "Other players decide in turn order whether or not they accept the offering (choosing a nonenchantment, nontoken permanent and drawing a card). Each player will know the decisions of previous players in turn order when making their decision.",
                "After each other player has decided, the stealing effect happens simultaneously for each one who accepted the offering."
            ]
        },
        {
            "id": 57,
            "name": "The King over the Scrapyard",
            "name_anchor": "the-king-over-the-scrapyard",
            "uri": "https://mtgtreachery.net/rules/oracle/?card=the-king-over-the-scrapyard",
            "cost": "",
            "cmc": 0,
            "color": "multicolor",
            "type": "Identity — Leader",
            "types": {
                "supertype": "Identity",
                "subtype": "Leader"
            },
            "rarity": "R",
            "text": "Whenever a creature you control dies, if it was attacking or blocking, create a Junk token or a Treasure token. (A Junk token is an artifact with “{T}, Sacrifice this token: Exile the top card of your library. You may play that card this turn. Activate only as a sorcery.”)|Whenever a spell or ability an opponent controls causes a nontoken permanent you control to leave the battlefield, create a Junk token and a Treasure token.",
            "flavor": "",
            "artist": "Ralph Horsley @ DeviantArt",
            "rulings": [
                "The King over the Scrapyard’s first ability triggers for each attacking or blocking creature you control that dies. For each of them, you can choose to either create a Junk token or a Treasure token on resolution, but not both tokens.",
                "The King over the Scrapyard’s second ability triggers only on spells and abilities that directly causes a nontoken permanent to leave the battlefield. The following won’t cause The King over the Scrapyard’s second ability to trigger: If a spell or ability an opponent controls deals lethal damage to a creature you control, removes all loyalty counters from a planeswalker you control, or causes an ability you control to trigger (and then that ability destroys or exiles a permanent you control)."
            ]
        },
        {
            "id": 58,
            "name": "The Lich Queen",
            "name_anchor": "the-lich-queen",
            "uri": "https://mtgtreachery.net/rules/oracle/?card=the-lich-queen",
            "cost": "",
            "cmc": 0,
            "color": "multicolor",
            "type": "Identity — Leader",
            "types": {
                "supertype": "Identity",
                "subtype": "Leader"
            },
            "rarity": "M",
            "text": "Start the game with a number of grave counters on The Lich Queen equal to the number of players.|At the beginning of your upkeep, surveil 1.|Remove a grave counter from The Lich Queen: You may play target card from your graveyard this turn. If an instant or sorcery spell cast this way would be put into your graveyard, exile it instead. If it’s a permanent card, it enters with a finality counter on it. Activate only once each turn.",
            "flavor": "",
            "artist": "DavidBlac @ DeviantArt",
            "rulings": [
                "You pay all costs and follow all normal timing rules for spells cast and lands played using the permission granted by The Lich Queen’s last ability.",
                "If an instant or sorcery card you cast this way is countered, it will be exiled.",
                "If an instant or sorcery card you cast this way goes to a zone other than exile or a graveyard, perhaps because one of its abilities says to put it into its owner’s hand, it won’t be exiled. This is true even if that same card would be put into a graveyard later in the turn.",
                "Finality counters work on any permanent, not only creatures. If a permanent with a finality counter on it would be put into a graveyard from the battlefield, exile it instead.",
                "Finality counters don’t stop permanents from going to zones other than the graveyard from the battlefield. For example, if a permanent with a finality counter on it would be put into its owner’s hand from the battlefield, it does so normally.",
                "Finality counters aren’t keyword counters, and a finality counter doesn’t give any abilities to the permanent it’s on. If that permanent loses its abilities and then would go to a graveyard, it will still be exiled instead.",
                "Multiple finality counters on a single permanent are redundant.",
                "Counters on identity cards cannot be proliferated because identity cards aren’t permanents."
            ]
        },
        {
            "id": 59,
            "name": "The Old Ruler",
            "name_anchor": "the-old-ruler",
            "uri": "https://mtgtreachery.net/rules/oracle/?card=the-old-ruler",
            "cost": "",
            "cmc": 0,
            "color": "multicolor",
            "type": "Identity — Leader",
            "types": {
                "supertype": "Identity",
                "subtype": "Leader"
            },
            "rarity": "U",
            "text": "(Start the game with this identity face up in the command zone. You are the starting player.)|Your starting life total is increased by 20.|Your starting hand size and your maximum hand size are each increased by one.|At the beginning of your first upkeep, create a Blood token, a Clue token, a Food token, a Map token, and a Treasure token.",
            "flavor": "",
            "artist": "AnthonyFoti (Tony Foti) @ DeviantArt",
            "rulings": [
                "Even though your starting hand size is increased by one, nothing else about the pregame procedure changes.",
                "A Blood token is an artifact with \"{1}, {T}, Discard a card, Sacrifice this token: Draw a card.\"",
                "A Clue token is an artifact with \"{2}, Sacrifice this token: Draw a card.\"",
                "A Food token is an artifact with \"{2}, {T}, Sacrifice this token: You gain 3 life.\"",
                "A Map token is an artifact with \"{1}, {T}, Sacrifice this token: Target creature you control explores. Activate only as a sorcery. (Reveal the top card of your library. Put that card into your hand if it’s a land. Otherwise, put a +1/+1 counter on that creature, then put the card back or put it into your graveyard.)\"",
                "A Treasure token is an artifact with \"{T}, Sacrifice this token: Add one mana of any color.\""
            ]
        },
        {
            "id": 60,
            "name": "The Queen of Light",
            "name_anchor": "the-queen-of-light",
            "uri": "https://mtgtreachery.net/rules/oracle/?card=the-queen-of-light",
            "cost": "",
            "cmc": 0,
            "color": "multicolor",
            "type": "Identity — Leader",
            "types": {
                "supertype": "Identity",
                "subtype": "Leader"
            },
            "rarity": "U",
            "text": "(Start the game with this identity face up in the command zone. You are the starting player.)|Start the game with a number of purification counters on The Queen of Light equal to half the number of players, rounded down.|{3}, Remove a purification counter from The Queen of Light: Exile a permanent of your choice. (This ability doesn’t target anything. You choose a permanent as it resolves.)",
            "flavor": "",
            "artist": "Jason Engle @ DeviantArt",
            "rulings": [
                "The affected permanent isn’t targeted. The Leader player may choose a permanent with shroud, for example.",
                "Once The Queen of Light’s ability begins to resolve, no players may take other actions until it’s done. Notably, players can’t try to save their permanent after you’ve chosen it.",
                "Counters on identity cards cannot be proliferated because identity cards aren’t permanents."
            ]
        },
        {
            "id": 61,
            "name": "The Twin Princesses",
            "name_anchor": "the-twin-princesses",
            "uri": "https://mtgtreachery.net/rules/oracle/?card=the-twin-princesses",
            "cost": "",
            "cmc": 0,
            "color": "multicolor",
            "type": "Identity — Leader",
            "types": {
                "supertype": "Identity",
                "subtype": "Leader"
            },
            "rarity": "R",
            "text": "(Start the game with this identity face up in the command zone. You are the starting player.)|{2}: Copy target activated or triggered ability you control. You may choose new targets for the copy. Activate only once each turn. (Mana abilities can’t be targeted.)",
            "flavor": "",
            "artist": "phoenixlu @ DeviantArt",
            "rulings": [
                "Activated abilities contain a colon. They’re written in the form \"[Cost]: [Effect].\" Some keyword abilities, such as equip and crew, are activated abilities and will have colons in their reminder texts.",
                "Triggered abilities use the word \"when,\" \"whenever,\" or \"at.\" They’re often written as \"[Trigger condition], [effect].\" Some keyword abilities, such as prowess and fabricate, are triggered abilities and will have \"when,\" \"whenever,\" or \"at\" in their reminder text.",
                "The Twin Princess’ ability targets an activated or triggered ability that was activated or has triggered and is on the stack. It creates another instance of that ability on the stack. It doesn’t cause any object to gain an ability.",
                "The source of the copy is the same as the source of the original ability.",
                "If the activated or triggered ability is modal (that is, if it says, \"Choose one —\" or similar), the mode is copied and can’t be changed.",
                "If the activated or triggered ability divides damage or distributes counters among a number of targets (for example, the ability of Bogardan Hellkite), the division and number of targets can’t be changed. If you choose new targets, you must choose the same number of targets.",
                "Any choices made when the activated or triggered ability resolves won’t have been made yet when it’s copied. Any such choices will be made separately when the copy resolves. If the activated or triggered ability asks you to pay a cost (such as that of Frenzied Goblin), you pay that cost for the copy.",
                "If a triggered ability is linked to a second ability, copies of that triggered ability are also linked to that second ability. If the second ability refers to \"the exiled card,\" it refers to all cards exiled by the triggered ability and the copy. For example, if Oblivion Ring’s enters-the-battlefield ability is copied and two permanents are exiled, they both return when Oblivion Ring leaves the battlefield.",
                "In some cases involving linked abilities, an ability requires information about \"the exiled card.\" When this happens, the ability gets multiple answers. If these answers are being used to determine the value of a variable, the sum is used. For example, if Elite Arcanist’s enters-the-battlefield ability is copied, two cards are exiled. The value of X in the activation cost of Elite Arcanist’s other ability is the sum of the two cards’ converted mana costs. As the ability resolves, you create copies of both cards and can cast none, one, or both of the copies in any order.",
                "A mana ability is an ability that (1) isn’t a loyalty ability, (2) doesn’t target, and (3) could put mana into a player’s mana pool when it resolves."
            ]
        },
        {
            "id": 62,
            "name": "The Void Tyrant",
            "name_anchor": "the-void-tyrant",
            "uri": "https://mtgtreachery.net/rules/oracle/?card=the-void-tyrant",
            "cost": "",
            "cmc": 0,
            "color": "multicolor",
            "type": "Identity — Leader",
            "types": {
                "supertype": "Identity",
                "subtype": "Leader"
            },
            "rarity": "U",
            "text": "(Start the game with this identity face up in the command zone. You are the starting player.)|Start the game with a number of void counters on The Void Tyrant equal to half the number of players, rounded down.|{2}, Remove a void counter from The Void Tyrant: Counter target spell or ability from a nonidentity source. (Mana abilities can’t be targeted.)",
            "flavor": "",
            "artist": "Grivetart (Bastien Grivet) @ DeviantArt",
            "rulings": [
                "Counters on identity cards cannot be proliferated because identity cards aren’t permanents.",
                "Activated abilities contain a colon. They’re written in the form \"[Cost]: [Effect].\" Some keyword abilities, such as equip and crew, are activated abilities and will have colons in their reminder texts.",
                "Triggered abilities use the word \"when,\" \"whenever,\" or \"at.\" They’re often written as \"[Trigger condition], [effect].\" Some keyword abilities, such as prowess and fabricate, are triggered abilities and will have \"when,\" \"whenever,\" or \"at\" in their reminder text.",
                "Only activated and triggered abilities on the stack can be countered. Static abilities of objects can’t be targeted.",
                "If you counter a delayed triggered ability that triggers at the beginning of the \"next\" occurrence of a specified step or phase, that ability won’t trigger again the following time that phase or step occurs.",
                "An activated mana ability is one that adds mana to a player’s mana pool as it resolves, doesn’t have a target, and isn’t a loyalty ability. A triggered mana ability is one that adds mana to a player’s mana pool and triggers on an activated mana ability.",
                "Abilities that create replacement effects, such as a permanent entering the battlefield tapped or with counters on it, can’t be targeted. Abilities that apply \"as [this creature] enters the battlefield\" are also replacement effects and can’t be targeted."
            ]
        }
    ]
}
